// /**
//
// Copyright (c) 2010 - 2012, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution. The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
//   Module Name:
//
// BcfgStrings.uni
//
// Abstract:
//
//   String definitions for the Shell bcfg command
//
//
// **/

/=#

#langdef   eng  "English"

#string STR_BCFG_NO_MEM           #language eng  "%hs: Not enough memory.\n"
#string STR_BCFG_NONE             #language eng  "%hs: No options found.\n"
#string STR_BCFG_ARG_PROBLEM      #language eng  "%hs: The argument '%hs' is incorrect.\n"
#string STR_BCFG_NO_DRIVER_BOOT   #language eng  "%hs: Driver or Boot must be selected.\n"
#string STR_BCFG_NUMB_RANGE       #language eng  "%hs: Numbers must be < %d.\n"
#string STR_BCFG_BOOT_ONLY        #language eng  "%hs: Boot must be selected for hot key options.\n"
#string STR_BCFG_HANDLE           #language eng  "%hs: The handle [%02hx] does not have DevicePath.\n"
#string STR_BCFG_HANDLE_DP        #language eng  "%hs: The handle [%02hx] could not convert to DevicePath: %r.\n"
#string STR_BCFG_FILE_DP          #language eng  "%hs: The file '%hs' could not convert to DevicePath.\n"
#string STR_BCFG_TARGET_NF        #language eng  "%hs: Could not find unused target index.\n"
#string STR_BCFG_HOTKEY_NF        #language eng  "%hs: Could not find unused hot key index.\n"
#string STR_BCFG_FILE_MULTI       #language eng  "%hs: The file '%hs' matches multiple files.\n"
#string STR_BCFG_FILE_OPEN_FAIL   #language eng  "%hs: The file '%hs' did not open: %r.\n"
#string STR_BCFG_FILE_READ_FAIL   #language eng  "%hs: Unable to read file '%hs': %r.\n"
#string STR_BCFG_VAR_NF           #language eng  "%hs: The target variable '%hs' was not found.\n"
#string STR_BCFG_VAR_READ_FAIL    #language eng  "%hs: Unable to read variable '%hs': %r.\n"
#string STR_BCFG_VAR_SET_FAIL     #language eng  "%hs: Unable to set variale '%hs': %r.\n"
#string STR_BCFG_VAR_UNSET_FAIL   #language eng  "%hs: Unable to unset variable '%hs': %r.\n"

#string STR_BCFG_ADDED_AT_POS     #language eng  "Added '%hs' at position %hd.\n"
#string STR_BCFG_SET_TO           #language eng  "Set %hd to '%hs'.\n"
#string STR_BCFG_LOAD_OPTION      #language eng  "Option: %3hd. Variable: %-11hs\n"
                                                 "  Desc    - %s\n"
                                                 "  DevPath - %s\n"
                                                 "  Optional- %c\n"

#string STR_BCFG_LINE_HELP        #language eng  "Manages the boot and driver options that are stored in NVRAM"
#string STR_BCFG_VERBOSE_HELP     #language eng  "Manages the boot and driver options that are stored in NVRAM.\n"
                                                 "\n"
                                                 "BCFG {driver|boot} dump [-v]\n"
                                                 "BCFG {driver|boot} add # <file> <desc>\n"
                                                 "BCFG {driver|boot} addh # <handle> <desc>\n"
                                                 "BCFG {driver|boot} mv # #\n"
                                                 "BCFG {driver|boot} rm #\n"
                                                 "BCFG {driver|boot} -opt # {<file>|<data>|<KeyData> {<ScanCode> <UCS2Char>} ...}\n"
                                                 "\n"
                                                 "    driver     - Display or modify the driver option list.\n"
                                                 "    boot       - Display or modify the boot option list.\n"
                                                 "    dump       - Display the option list.\n"
                                                 "    -v         - Display  the  option  list  with  extra  info  including  the\n"
                                                 "                 optional data.\n"
                                                 "    add        - Add an option. The # is the number of  options  to  add.  The\n"
                                                 "                 <file>  is  the  file name of the UEFI application/driver for\n"
                                                 "                 the option. The <desc> parameter is the  description  of  the\n"
                                                 "                 option being added.\n"
                                                 "    addh       - Add  an option that refers to the driver specified by handle.\n"
                                                 "                 The # is the number of options to add. The  <handle>  is  the\n"
                                                 "                 driver  handle. The file of the device path for the option is\n"
                                                 "                 retrieved from  the  handle.  The  <desc>  parameter  is  the\n"
                                                 "                 description of the option being added.\n"
                                                 "    mv         - Move  an option. The first numeric parameter is the number of\n"
                                                 "                 the option to move. The second numeric parameter is  the  new\n"
                                                 "                 number of the option being moved.\n"
                                                 "    rm         - Remove  an  option. The parameter is the number of the option\n"
                                                 "                 to remove.\n"
                                                 "    -opt       - Modify the optional data associated with  a  driver  or  boot\n"
                                                 "                 option.  Followed  either  by the file name of the file which\n"
                                                 "                 contains the binary data to be inserted into  the  driver  or\n"
                                                 "                 boot option or else the key option data which will be associ‐\n"
                                                 "                 ated with the driver or boot option.\n"
                                                 "    <KeyData>  - The packed value associated  with  a  hot-key.  This  is  the\n"
                                                 "                 equivalent  of  the EFI_KEY_DATA value in the UEFI specifica‐\n"
                                                 "                 tion.\n"
                                                 "    <ScanCode> - This  is  the  UEFI-defined  Scan   code   portion   of   the\n"
                                                 "                 EFI_INPUT_KEY  struction.  This  value is directly associated\n"
                                                 "                 with the preceding KeyData value and there  may  be  1  to  4\n"
                                                 "                 entries per the UEFI specification. When one instance of this\n"
                                                 "                 parameter has a non-zero value, the paired UnicodeChar  value\n"
                                                 "                 will have a zero-based value.\n"
                                                 "    <UCS2Char> - This  is  the Unicode value for the character associated with\n"
                                                 "                 the preceding KeyData value. There may be 1 to 3 entries  per\n"
                                                 "                 the  UEFI  specification. When one instance of this parameter\n"
                                                 "                 has a non-zero value, the paired ScanCode value will  have  a\n"
                                                 "                 zero-based value.\n"
                                                 "\n"
                                                 "Note:\n"
                                                 "    This  command can display the Boot#### or Driver#### environment variables\n"
                                                 "    by using the dump option. The add option can be used to add a new Boot####\n"
                                                 "    or  Driver#### environment variable. The rm option can be used to delete a\n"
                                                 "    Boot#### or Driver#### environment variable, and finally, then  mv  option\n"
                                                 "    can  be used to reorder the Boot#### and Driver#### environment variables.\n"
                                                 "    The add, rm, and mv options also update the BootOrder or DriverOrder envi‐\n"
                                                 "    ronment variables as appropriate.\n"
                                                 "\n"
                                                 "Examples:\n"
                                                 "  * To display driver options:\n"
                                                 "    fs0:\\> bcfg driver dump\n"
                                                 "\n"
                                                 "  * To display boot options:\n"
                                                 "    fs0:\\> bcfg boot dump\n"
                                                 "\n"
                                                 "  * To display verbosely of boot options:\n"
                                                 "    fs0:\\> bcfg boot dump -v\n"
                                                 "\n"
                                                 "  * To add a driver option #5:\n"
                                                 "    fs0:\\> bcfg driver add 5 mydriver.efi \"My Driver\"\n"
                                                 "\n"
                                                 "  * To add a boot option #3:\n"
                                                 "    fs0:\\> bcfg boot add 3 osloader.efi \"My OS\"\n"
                                                 "\n"
                                                 "  * To remove boot option #3:\n"
                                                 "    fs0:\\> bcfg boot rm 3\n"
                                                 "\n"
                                                 "  * To move boot option #3 to boot option #7:\n"
                                                 "    fs0:\\> bcfg boot mv 3 7\n"
                                                 "\n"
                                                 "  * To assign a CTRL-B hot-key to boot option #3:\n"
                                                 "    fs0:\\> bcfg boot -opt 3 0x40000200 0 0x42\n"
                                                 "\n"
                                                 "Return Values:\n"
                                                 "    EFI_SUCCESS            - The action was completed as requested.\n"
                                                 "    EFI_NOT_FOUND          - The requested option was not found.\n"
                                                 "    EFI_INVALID_PARAMETER  - One  of  the passed in parameters was incorrectly\n"
                                                 "                             formatted or its value was out of bounds.\n"
                                                 "    EFI_UNSUPPORTED        - The action as requested was unsupported.\n"
                                                 "    EFI_SECURITY_VIOLATION - This function was not performed due to a security\n"
                                                 "                             violation.\n"
                                                 "    EFI_OUT_OF_RESOURCES   - There was insufficient free space for the request\n"
                                                 "                             to be completed.\n"
